Revit 2027 API
BuiltInFailures.SketchFailures.LoopIntersectError Property
 Lines cannot intersect each other. The highlighted lines currently intersect.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LoopIntersectError { get; }
Public Shared ReadOnly Property LoopIntersectError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LoopIntersectError {
	FailureDefinitionId^ get ();
}
static member LoopIntersectError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace